waveshareteam/ESP32-S3-Touch-LCD-1.83/examples/esp-idf/01_AXP2101/main/axp2101_registers.h
#pragma once

#include <stdint.h>

#define AXP2101_I2C_ADDRESS 0x34
#define AXP2101_CHIP_ID 0x4A

#define AXP2101_REG_STATUS1 0x00
#define AXP2101_REG_STATUS2 0x01
#define AXP2101_REG_IC_TYPE 0x03
#define AXP2101_REG_ADC_CHANNEL_CTRL 0x30
#define AXP2101_REG_ADC_DATA_RESULT0 0x34
#define AXP2101_REG_ADC_DATA_RESULT1 0x35
#define AXP2101_REG_ADC_DATA_RESULT4 0x38
#define AXP2101_REG_ADC_DATA_RESULT5 0x39
#define AXP2101_REG_ADC_DATA_RESULT6 0x3A
#define AXP2101_REG_ADC_DATA_RESULT7 0x3B
#define AXP2101_REG_ADC_DATA_RESULT8 0x3C
#define AXP2101_REG_ADC_DATA_RESULT9 0x3D
#define AXP2101_REG_INTEN1 0x40
#define AXP2101_REG_INTEN2 0x41
#define AXP2101_REG_INTEN3 0x42
#define AXP2101_REG_INTSTS1 0x48
#define AXP2101_REG_INTSTS2 0x49
#define AXP2101_REG_INTSTS3 0x4A
#define AXP2101_REG_IPRECHG_SET 0x61
#define AXP2101_REG_ICC_CHG_SET 0x62
#define AXP2101_REG_ITERM_CHG_SET_CTRL 0x63
#define AXP2101_REG_CV_CHG_VOL_SET 0x64
#define AXP2101_REG_DC_ONOFF_DVM_CTRL 0x80
#define AXP2101_REG_DC_VOL0_CTRL 0x82
#define AXP2101_REG_DC_VOL1_CTRL 0x83
#define AXP2101_REG_DC_VOL2_CTRL 0x84
#define AXP2101_REG_DC_VOL3_CTRL 0x85
#define AXP2101_REG_DC_VOL4_CTRL 0x86
#define AXP2101_REG_LDO_ONOFF_CTRL0 0x90
#define AXP2101_REG_LDO_ONOFF_CTRL1 0x91
#define AXP2101_REG_LDO_VOL0_CTRL 0x92
#define AXP2101_REG_LDO_VOL1_CTRL 0x93
#define AXP2101_REG_LDO_VOL2_CTRL 0x94
#define AXP2101_REG_LDO_VOL3_CTRL 0x95
#define AXP2101_REG_LDO_VOL4_CTRL 0x96
#define AXP2101_REG_LDO_VOL5_CTRL 0x97
#define AXP2101_REG_LDO_VOL6_CTRL 0x98
#define AXP2101_REG_LDO_VOL7_CTRL 0x99
#define AXP2101_REG_LDO_VOL8_CTRL 0x9A
#define AXP2101_REG_BAT_PERCENT_DATA 0xA4

#define AXP2101_DCDC1_MIN_MV 1500
#define AXP2101_DCDC1_MAX_MV 3400
#define AXP2101_DCDC1_STEP_MV 100

#define AXP2101_DCDC2_4_RANGE1_MIN_MV 500
#define AXP2101_DCDC2_4_RANGE1_STEP_MV 10
#define AXP2101_DCDC2_4_RANGE2_STEP_MV 20
#define AXP2101_DCDC2_4_RANGE2_BASE 71

#define AXP2101_DCDC3_RANGE3_BASE 88
#define AXP2101_DCDC3_RANGE3_STEP_MV 100

#define AXP2101_DCDC5_MIN_MV 1400
#define AXP2101_DCDC5_STEP_MV 100
#define AXP2101_DCDC5_1200MV_CODE 0x19

#define AXP2101_LDO_MIN_MV 500
#define AXP2101_LDO_STEP_MV 100
#define AXP2101_CPUSLDO_STEP_MV 50

#define AXP2101_PRECHARGE_50MA 2
#define AXP2101_CHARGE_CURRENT_400MA 10
#define AXP2101_TERMINATION_CURRENT_25MA 1
#define AXP2101_CHARGE_VOLTAGE_4V2 3

#define AXP2101_IRQ_BAT_REMOVE (1UL << 12)
#define AXP2101_IRQ_BAT_INSERT (1UL << 13)
#define AXP2101_IRQ_VBUS_REMOVE (1UL << 14)
#define AXP2101_IRQ_VBUS_INSERT (1UL << 15)
#define AXP2101_IRQ_PKEY_LONG (1UL << 10)
#define AXP2101_IRQ_PKEY_SHORT (1UL << 11)
#define AXP2101_IRQ_BAT_CHG_START (1UL << 19)
#define AXP2101_IRQ_BAT_CHG_DONE (1UL << 20)

typedef enum {
    AXP2101_CHG_TRI_STATE,
    AXP2101_CHG_PRE_STATE,
    AXP2101_CHG_CC_STATE,
    AXP2101_CHG_CV_STATE,
    AXP2101_CHG_DONE_STATE,
    AXP2101_CHG_STOP_STATE,
} axp2101_charge_state_t;
